examples/03_school_grades/src/Documents/ВыставлениеОценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыставлениеОценок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Успеваемость</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Учителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ученики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Оценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

examples/03_school_grades/src/AccumulationRegisters/Успеваемость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Успеваемость</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОценок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОценок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ученики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

examples/03_school_grades/src/Documents/ВыставлениеОценок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистру Успеваемость
	Движения.Успеваемость.Записывать = Истина;
	Для Каждого СтрокаТЧ Из Оценки Цикл
		Движение = Движения.Успеваемость.Добавить();
		Движение.Период = Дата;
		Движение.Ученик = СтрокаТЧ.Ученик;
		Движение.Предмет = Предмет;
		Движение.СуммаОценок = СтрокаТЧ.Оценка;
		Движение.КоличествоОценок = 1;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
